In [58]:
import sqlite3
import os.path

In [120]:
%sql sqlite:///D:/STAT 6969/acs-1-year-2015.sqlite
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

(sqlite3.OperationalError) near "6969": syntax error
[SQL: 6969/acs-1-year-2015.sqlite]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [121]:
%%sql
SELECT name FROM sqlite_master  
WHERE type = 'table'

 * sqlite:///D:/Stat
   sqlite:///D:Stat
   sqlite:///acs-1-year-2015.sql
   sqlite:///acs-1-year-2015.sqlite
Done.

[]

In [114]:
%%sql
SELECT * 
FROM states
LIMIT 10

   sqlite:///acs-1-year-2015.sql
 * sqlite:///acs-1-year-2015.sqlite
(sqlite3.OperationalError) no such table: states
[SQL: SELECT *
FROM states
LIMIT 10]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [45]:
%%sql 
SELECT SUM(white)
FROM states

 * sqlite:///acs-1-year-2015.sql
(sqlite3.OperationalError) no such table: states
[SQL: SELECT SUM(white)
FROM states]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [32]:
%%sql 
SELECT SUM(total_poulation)

 * sqlite:///acs-1-year-2015.sql
(sqlite3.OperationalError) no such column: total_poulation
[SQL: SELECT SUM(total_poulation)]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [33]:
%%sql
SELECT name,
    white / total_population AS ratio_white
FROM states
-- this is a comment
-- select ratio of white people in each state

 * sqlite:///acs-1-year-2015.sql
(sqlite3.OperationalError) no such table: states
[SQL: SELECT name,
    white / total_population AS ratio_white
FROM states
-- this is a comment
-- select ratio of white people in each state]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [35]:
%%sql
SELECT name,
    CAST(white AS FLOAT) / total_population AS ratio_white
FROM states
-- this is a comment
-- select ratio of white people in each state
-- got all zeros, so must CAST

 * sqlite:///acs-1-year-2015.sql
(sqlite3.OperationalError) no such table: states
[SQL: SELECT name,
    CAST(white AS FLOAT) / total_population AS ratio_white
FROM states
-- this is a comment
-- select ratio of white people in each state
-- got all zeros, so must CAST]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [38]:
%%sql
SELECT name,
    CAST(white AS FLOAT) / total_population AS ratio_white,
    CAST(black AS FLOAT) / total_population AS ratio_black,
    CAST(hispanic AS FLOAT) / total_population AS ratio_hispanic,
    CAST(asian AS FLOAT) / total_population AS ratio_asian,
    CAST(american_indian AS FLOAT) / total_population AS ratio_american_indian,
    CAST( pacific_islander AS FLOAT) / total_population AS ratio_pacific_islander,
    CAST(other_race AS FLOAT) / total_population AS ratio_other_race
FROM states
LIMIT 10

 * sqlite:///acs-1-year-2015.sql
(sqlite3.OperationalError) no such table: states
[SQL: SELECT name,
    CAST(white AS FLOAT) / total_population AS ratio_white,
    CAST(black AS FLOAT) / total_population AS ratio_black,
    CAST(hispanic AS FLOAT) / total_population AS ratio_hispanic,
    CAST(asian AS FLOAT) / total_population AS ratio_asian,
    CAST(american_indian AS FLOAT) / total_population AS ratio_american_indian,
    CAST( pacific_islander AS FLOAT) / total_population AS ratio_pacific_islander,
    CAST(other_race AS FLOAT) / total_population AS ratio_other_race
FROM states
LIMIT 10]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [39]:
%%sql
-- want to order by highest to lowest ratio of hispanic population
SELECT name,
    CAST(white AS FLOAT) / total_population AS ratio_white,
    CAST(black AS FLOAT) / total_population AS ratio_black,
    CAST(hispanic AS FLOAT) / total_population AS ratio_hispanic,
    CAST(asian AS FLOAT) / total_population AS ratio_asian,
    CAST(american_indian AS FLOAT) / total_population AS ratio_american_indian,
    CAST( pacific_islander AS FLOAT) / total_population AS ratio_pacific_islander,
    CAST(other_race AS FLOAT) / total_population AS ratio_other_race
FROM states
ORDER BY ratio_hispanic DESC
LIMIT 10

 * sqlite:///acs-1-year-2015.sql
(sqlite3.OperationalError) no such table: states
[SQL: -- want to order by highest to lowest ratio of hispanic population
SELECT name,
    CAST(white AS FLOAT) / total_population AS ratio_white,
    CAST(black AS FLOAT) / total_population AS ratio_black,
    CAST(hispanic AS FLOAT) / total_population AS ratio_hispanic,
    CAST(asian AS FLOAT) / total_population AS ratio_asian,
    CAST(american_indian AS FLOAT) / total_population AS ratio_american_indian,
    CAST( pacific_islander AS FLOAT) / total_population AS ratio_pacific_islander,
    CAST(other_race AS FLOAT) / total_population AS ratio_other_race
FROM states
ORDER BY ratio_hispanic DESC
LIMIT 10]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [47]:
%%sql
-- Find the 5 poorest states by per-capita income
SELECT name, per_capita_income
FROM states
ORDER BY per_capita_income
LIMIT 5

 * sqlite:///acs-1-year-2015.sql
(sqlite3.OperationalError) no such table: states
[SQL: -- Find the 5 poorest states by per-capita income
SELECT name, per_capita_income
FROM states
ORDER BY per_capita_income
LIMIT 5]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [48]:
%%sql
-- Find the 5 wealthiest states by per-capita income
SELECT name, per_capita_income
FROM states
ORDER BY per_capita_income DESC
LIMIT 5

 * sqlite:///acs-1-year-2015.sql
(sqlite3.OperationalError) no such table: states
[SQL: -- Find the 5 wealthiest states by per-capita income
SELECT name, per_capita_income
FROM states
ORDER BY per_capita_income DESC
LIMIT 5]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [49]:
%%sql
SELECT *
FROM congressional_districts
LIMIT 5

 * sqlite:///acs-1-year-2015.sql
(sqlite3.OperationalError) no such table: congressional_districts
[SQL: SELECT *
FROM congressional_districts
LIMIT 5]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [60]:
#Let's try to find the average population per congressional district by state

%%sql
SELECT
FROM congressional_districts AS cd
JOIN states AS s ON s.state = cd.state -- INNER JOIN (only select rows where there is a match)

SyntaxError: invalid syntax (2073603591.py, line 5)

In [61]:
# For each state, find the lowest median_household_income district within that state

In [62]:
%%sql
SELECT s.name, MIN(cd.median_household_income) AS min_income
FROM congressional_districts cd
JOIN states s ON s.state = cd.state
GROUP BY s.name
LIMIT 5

 * sqlite:///acs-1-year-2015.sql
   sqlite:///acs-1-year-2015.sqlite
(sqlite3.OperationalError) no such table: congressional_districts
[SQL: SELECT s.name, MIN(cd.median_household_income) AS min_income
FROM congressional_districts cd
JOIN states s ON s.state = cd.state
GROUP BY s.name
LIMIT 5]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
%%sql 
SELECT MAX(min_income_district)
FROM(SELECT s.name, MIN(cd.median_household_income) AS min_income_district
FROM congressional_districts cd
JOIN states s ON s.state = cd.state
GROUP BY s.name
LIMIT 5)

 * sqlite:///acs-1-year-2015.sql
   sqlite:///acs-1-year-2015.sqlite
(sqlite3.OperationalError) no such table: congressional_districts
[SQL: SELECT MAX(min_income_district)
FROM(SELECT s.name, MIN(cd.median_household_income) AS min_income
FROM congressional_districts cd
JOIN states s ON s.state = cd.state
GROUP BY s.name
LIMIT 5)]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [64]:
%%sql 
SELECT name, min_income_district
FROM(SELECT s.name, MIN(cd.median_household_income) AS min_income_district,
row_number() OVER (ORDER BY MIN(cd.median_household_income) DESC) AS row_num
FROM congressional_districts cd
JOIN states s ON s.state = cd.state
GROUP BY s.name
LIMIT 5)
WHERE row_num = 1

 * sqlite:///acs-1-year-2015.sql
   sqlite:///acs-1-year-2015.sqlite
(sqlite3.OperationalError) no such table: congressional_districts
[SQL: SELECT name, min_income_district
FROM(SELECT s.name, MIN(cd.median_household_income) AS min_income_district,
row_number() OVER (ORDER BY MIN(cd.median_household_income) DESC) AS row_num
FROM congressional_districts cd
JOIN states s ON s.state = cd.state
GROUP BY s.name
LIMIT 5)
WHERE row_num = 1]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [68]:
%%sql
SELECT s.name, MIN(cd.median_household_income) AS min_income_district
FROM congressional_districts cd
JOIN states s ON s.state = cd.state
GROUP BY s.name
ORDER BY min_income_district DESC
LIMIT 1

   sqlite:///acs-1-year-2015.sql
 * sqlite:///acs-1-year-2015.sqlite
(sqlite3.OperationalError) no such table: congressional_districts
[SQL: SELECT s.name, MIN(cd.median_household_income) AS min_income_district
FROM congressional_districts cd
JOIN states s ON s.state = cd.state
GROUP BY s.name
ORDER BY min_income_district DESC
LIMIT 1]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [69]:
%%sql
SELECT *
FROM ages

   sqlite:///acs-1-year-2015.sql
 * sqlite:///acs-1-year-2015.sqlite
(sqlite3.OperationalError) no such table: ages
[SQL: SELECT *
FROM ages]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [70]:
%%sql 
SELECT *
FROM favorite_colors

   sqlite:///acs-1-year-2015.sql
 * sqlite:///acs-1-year-2015.sqlite
(sqlite3.OperationalError) no such table: favorite_colors
[SQL: SELECT *
FROM favorite_colors]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [72]:
%%sql
SELECT *
FROM ages
JOIN favorite_colors --INNER JOIN
ON ages.name = favorite_colors.name

   sqlite:///acs-1-year-2015.sql
 * sqlite:///acs-1-year-2015.sqlite
(sqlite3.OperationalError) no such table: ages
[SQL: SELECT *
FROM ages
JOIN favorite_colors --INNER JOIN
ON ages.name = favorite_colors.name]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [97]:
%%sql
CREATE TABLE my_new_table (
    name TEXT, 
    age INTEGER, 
    shoe_size REAL
)

   sqlite:///acs-1-year-2015.sql
 * sqlite:///acs-1-year-2015.sqlite
Done.

[]

In [98]:
%%sql
SELECT * 
FROM my_new_table

   sqlite:///acs-1-year-2015.sql
 * sqlite:///acs-1-year-2015.sqlite
Done.

[]

In [99]:
%%sql
INSERT INTO my_new_table (name, age, shoe_size)
VALUES
('Keith', 57, 11.5),
('Fred', 93, 10), 
('Geraldina', 44, 7.5)

   sqlite:///acs-1-year-2015.sql
 * sqlite:///acs-1-year-2015.sqlite
3 rows affected.

[]

In [100]:
%%sql 
SELECT * 
FROM my_new_table

   sqlite:///acs-1-year-2015.sql
 * sqlite:///acs-1-year-2015.sqlite
Done.

[('Keith', 57, 11.5), ('Fred', 93, 10.0), ('Geraldina', 44, 7.5)]

In [101]:
%%sql
SELECT age * shoe_size
FROM my_new_table

   sqlite:///acs-1-year-2015.sql
 * sqlite:///acs-1-year-2015.sqlite
Done.

[(655.5,), (930.0,), (330.0,)]

In [102]:
%%sql
INSERT INTO my_new_table (name, age)
VALUES
('Gandalf', 7215), 
('Galadriel', 11975)

   sqlite:///acs-1-year-2015.sql
 * sqlite:///acs-1-year-2015.sqlite
2 rows affected.

[]

In [103]:
%%sql
SELECT *
FROM my_new_table

   sqlite:///acs-1-year-2015.sql
 * sqlite:///acs-1-year-2015.sqlite
Done.

[('Keith', 57, 11.5),
 ('Fred', 93, 10.0),
 ('Geraldina', 44, 7.5),
 ('Gandalf', 7215, None),
 ('Galadriel', 11975, None)]

In [104]:
# constraints exist in some dialects of SQL
# they can consist of things like a non-null constraint

In [106]:
%%sql 
UPDATE my_new_table
SET age = 6999
WHERE name = 'Gandalf'

   sqlite:///acs-1-year-2015.sql
 * sqlite:///acs-1-year-2015.sqlite
1 rows affected.

[]

In [107]:
%%sql
SELECT *
FROM my_new_table

   sqlite:///acs-1-year-2015.sql
 * sqlite:///acs-1-year-2015.sqlite
Done.

[('Keith', 57, 11.5),
 ('Fred', 93, 10.0),
 ('Geraldina', 44, 7.5),
 ('Gandalf', 6999, None),
 ('Galadriel', 11975, None)]

In [96]:
%%sql
DROP TABLE my_new_table

   sqlite:///acs-1-year-2015.sql
 * sqlite:///acs-1-year-2015.sqlite
Done.

[]